w809291634/EPnode_OTA/STM32F4 XBootF4 V1.1/Project/XBoot/src/ymodem.c
/* YMODEM support for bootldr
 * ^^^^^^^^^^^^^^^^^^^^^^^^^^
 * Copyright (C) 2001  John G Dorsey
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
 *
 * The author may be contacted via electronic mail at <john+@cs.cmu.edu>,
 * or at the following address:
 *
 *   John Dorsey
 *   Carnegie Mellon University
 *   HbH2201 - ICES
 *   5000 Forbes Avenue
 *   Pittsburgh, PA  15213
 *
 *
 * Notes:
 * ^^^^^^
 * Tested against lsz (`sb') from within Minicom. The YMODEM spec says
 * that the receiver should just keep sending CRC/NAKs to the sender 
 * until the transfer begins, but something breaks if a CRC/YMODEM_NAK is
 * sent out while the user is typing in a filename to Minicom. Best
 * solution currently is just to repeat the transfer.
 *
 * History:
 * ^^^^^^^^
 * 12 March, 2001 - created. (jd)
 *
 */

#include "stm32f4xx.h"
#include "flash_if.h"
#include "command.h"
#include "main.h"
#include "flash.h"

//#include <stdarg.h>
//#include <stdio.h>

/*********************************************************************************************************
** 函数名称: RunUserProgram
** 功能描述: 运行用户程序。
** 输　入: cp		要发送数据的缓冲区指针
** 输　出: 无
** 全局变量: 无
** 调用模块: 
**
** 作　者: 
** 日　期: 
**-------------------------------------------------------------------------------------------------------
** 修改人: 
** 日　期: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
//__asm static void SystemReset(void) 
//{ 
// MOV R0, #1           //;  
// MSR FAULTMASK, R0    //; 清除FAULTMASK 禁止一切中断 
// LDR R0, =0xE000ED0C  //; 
// LDR R1, =0x05FA0004  //; 
// STR R1, [R0]         //; 系统软件复位  

//deadloop 
//    B deadloop        //; 等待复位成功
//} 
/*********************************************************************************************************
** 函数名称: RunUserProgram
** 功能描述: 运行用户程序。
** 输　入: cp		要发送数据的缓冲区指针
** 输　出: 无
** 全局变量: 无
** 调用模块: 
**
** 作　者: 
** 日　期: 
**-------------------------------------------------------------------------------------------------------
** 修改人: 
** 日　期: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
//static void Encryption(void){
//		uint32_t dat1,dat2,dat3;
//		extern unsigned char userdata[];
//	  user_data_t *p = (user_data_t*)userdata;
//	
//		dat1 = *(volatile unsigned*)(0x1FFF7A18);
//	  dat2 = *(volatile unsigned*)(0x1FFF7A14);
//	  dat3 = *(volatile unsigned*)(0x1FFF7A10);
//	  
//	  if(dat1 != p->hw_id[2] || dat2 != p->hw_id[1] || dat3 != p->hw_id[0] || p->boot_enable != BOOT_ENABLE)
//			SystemReset();
//}
/*********************************************************************************************************
** 函数名称: RunUserProgram
** 功能描述: 运行用户程序。
** 输　入: cp		要发送数据的缓冲区指针
** 输　出: 无
** 全局变量: 无
** 调用模块: 
**
** 作　者: 
** 日　期: 
**-------------------------------------------------------------------------------------------------------
** 修改人: 
** 日　期: 
**------------------------------------------------------------------------------------------------------
********************************************************************************************************/
void RunUserProgram(uint32_t programe_addr) {
  typedef  void (*pFunction)(void);
	pFunction Jump_To_Application; 
  unsigned JumpAddress;	
//	Encryption();
  extern unsigned char userdata[];
	user_data_t *p = (user_data_t*)userdata;
  
  /*跳转区不存在可运行程序；或跳转到APP时，若APP未准备好：切回IAP模式并复位*/
  if ((((*(__IO uint32_t*)programe_addr) & 0x2FFE0000 ) != 0x20000000) ||\
      (programe_addr == APPLICATION_ADDRESS && p->app_en != APP_OK)) {
    p->boot_mode = BOOT_IAP;
    p->app_en = APP_ERR;
    flash_write(FLASH_PARAM_START_ADDR, (unsigned char *)(userdata), sizeof(user_data_t));
    NVIC_SystemReset();
    while(1);
  }

  //关闭串口功能
	USART_Cmd(TERM_UART, DISABLE);
	USART_ITConfig(TERM_UART, USART_IT_RXNE, DISABLE);
	USART_ClearITPendingBit(TERM_UART, USART_IT_RXNE);
  USART_DeInit(TERM_UART);
	TERM_UART_CLK_INIT(TERM_UART_CLK, DISABLE);
  //重置串口引脚
  GPIO_DeInit(TERM_GPIO_PORT);
  RCC_AHB1PeriphClockCmd(TERM_GPIO_CLK, DISABLE);
  //重置运行灯、按键引脚
  LED_OFF(); 
  GPIO_DeInit(LED_RUN_PORT);
  GPIO_DeInit(REC_DETECT_PORT);
  RCC_AHB1PeriphClockCmd(LED_RUN_CLK, DISABLE);
  RCC_AHB1PeriphClockCmd(REC_DETECT_CLK, DISABLE);
  
		/* Jump to user application */
	JumpAddress = *(volatile unsigned*) (programe_addr + 4);
	Jump_To_Application = (pFunction) JumpAddress;
	/* Initialize user application's Stack Pointer */
	__set_PSP(*(volatile unsigned*) programe_addr);
	__set_CONTROL(0);
	__set_MSP(*(volatile unsigned*) programe_addr);
	Jump_To_Application();
}
/*********************************************************************************************************
** Function name:           uint8 Uart0GetByte(void)
** Descriptions:            获取一个字节数据
** input parameters:        Buffer:发送数据存储位置
**                          NByte:发送数据个数
** Output parameters::      无
** Returned value:          无
** Created by:              Zhou Shaogang
** Created Date:            2006.11.18
**--------------------------------------------------------------------------------------------------------
** Modified by:             Ni Likao 倪力考
** Modified date:           2007.10.20 
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
//#include "stm32_eval.h"
void putcc(unsigned char dat){
		while (!(TERM_UART->SR & USART_FLAG_TXE));
		TERM_UART->DR = dat;
}
//#define OVER_TIME 5
char getcc(void){
	extern void LED_Toogle(void);
	extern int ringbuf_read(uint8_t *c);
	uint8_t result=0;
	unsigned counter=0;
//	unsigned bootdelay = OVER_TIME*4000000;

  while(ringbuf_read(&result)==0) {
    if(counter++ > 1234567) {
      counter = 0;
      LED_Toogle();
    }
  }
//	for(counter=0;counter<(bootdelay);counter++){
//		if(ringbuf_read(&result)==1) break;

//		if(counter%200000==0)
//		{
////			  IWDG_ReloadCounter();  
//				LED_Toogle();
//		}
//	}
//	if(counter==(bootdelay)){
//		printk("\t等待用户输入命令超时，进入用户程序\n");
////		IWDG_ReloadCounter();  
//		RunUserProgram(APPLICATION_ADDRESS);
//	}
	return result;
}
/**
  ******************************************************************************
  * @file    STM32L1xx_IAP/src/ymodem.c 
  * @author  MCD Application Team
  * @version V1.1.0
  * @date    24-January-2012
  * @brief   This file provides all the software functions related to the ymodem 
  *          protocol.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * FOR MORE INFORMATION PLEASE READ CAREFULLY THE LICENSE AGREEMENT FILE
  * LOCATED IN THE ROOT DIRECTORY OF THIS FIRMWARE PACKAGE.
  *
  * <h2><center>&copy; COPYRIGHT 2012 STMicroelectronics</center></h2>
  ******************************************************************************
  */

/** @addtogroup STM32L1xx_IAP
  * @{
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "common.h"
#include "ymodem.h"
#include "string.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
uint8_t FileName[FILE_NAME_LENGTH];
static  uint8_t Use_CRC=0;
static uint8_t tcp_valid=0;

