w809291634/EPnode_OTA/STM32F4 XBootF4 V1.1/Project/XBoot/src/ymodem.c
/* Private function prototypes -----------------------------------------------*/
uint16_t Cal_CRC16(const uint8_t *,uint32_t );
/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Receive byte from sender
  * @param  c: Character
  * @param  timeout: Timeout
  * @retval 0: Byte received
  *        -1: Timeout
  */
static  int32_t Receive_Byte (uint8_t *c, uint32_t timeout)
{
  while (timeout-- > 0)
  {
		if(0 == (timeout%10000)) IWDG_ReloadCounter();  
    if (SerialKeyPressed(c) == 1)
    {
      return 0;
    }
  }
  return -1;
}

/**
  * @brief  Send a byte
  * @param  c: Character
  * @retval 0: Byte sent
  */
static uint32_t Send_Byte (uint8_t c)
{
  SerialPutChar(c);
  return 0;
}

void ringbuf_flush(void);
/**
  * @brief  Receive a packet from sender
  * @param  data
  * @param  length
  * @param  timeout
  *     0: end of transmission
  *    -1: abort by sender
  *    >0: packet length
  * @retval 0: normally return
  *        -1: timeout or packet error
  *         1: abort by user
  */
static int32_t Receive_Packet (uint8_t *data, int32_t *length, uint32_t timeout)
{
  uint16_t i, packet_size;
  uint8_t c;
  *length = 0;
  if (Receive_Byte(&c, timeout) != 0)
  {
    return -1;
  }
  switch (c)
  {
    case YMODEM_SOH:
      packet_size = PACKET_SIZE;
      break;
    case YMODEM_STX:
      packet_size = PACKET_1K_SIZE;
      break;
    case YMODEM_EOT:
      return 0;
    case YMODEM_CAN:
      if ((Receive_Byte(&c, timeout) == 0) && (c == YMODEM_CAN))
      {
        *length = -1;
        return 0;
      }
      else
      {
        return -1;
      }
    case YMODEM_ABORT1:
    case YMODEM_ABORT2:
      return 1;
		/*****************************清除掉FF*****************************/
		case YMODEM_TCP:
			*data = c;
			for(i=1;i<6;i++){
				if (Receive_Byte(data + i, timeout) != 0)
				{
					return -1;
				}
			}
			if(*data == 0xFF && *(data+1)==0xFD && *(data+2)==0x00 && \
				 *(data+3)==0xFF && *(data+4)==0xFB && *(data+5)==0x00){
					tcp_valid = 1;
			}
			return -1;
		/*****************************************************************/
    default:
      return -1;
  }
  *data = c;
  for (int ff_flag = 0,i = 1; i < (packet_size +(Use_CRC? PACKET_OVERHEAD_CRC : PACKET_OVERHEAD)); i ++)
  {
    if (Receive_Byte(data + i, timeout) != 0)
    {
      return -1;
    }
		/*****************************清除掉FF*****************************/
		if(tcp_valid == 1){
			if(ff_flag == 1 && *(data+i) == 0xFF){
				i-=1;
				ff_flag = 0;
			}else{
				if(*(data+i) == 0xFF)
					ff_flag =1;
				else
					ff_flag = 0;
			}
		}
		/*****************************************************************/
  }
  if (data[PACKET_SEQNO_INDEX] != ((data[PACKET_SEQNO_COMP_INDEX] ^ 0xff) & 0xff))
  {
    return -1;
  }
	
	if(Use_CRC){
    /* It seems odd that the CRC doesn't cover the three preamble bytes. */
    if((Cal_CRC16((unsigned char *)(data + PACKET_HEADER), packet_size + PACKET_TRAILER_CRC)&0xFFFF) != 0)	{
			return -1;	//crc校验出错
		}
  } else {
    unsigned sum;
    for(i = PACKET_HEADER, sum = 0; i < packet_size + PACKET_HEADER; ++i)
      sum += data[i];

    if((sum & 0xff) != (data[i] & 0xff))
      return -1;	//累加和校验出错
  }
  *length = packet_size;
	ringbuf_flush();
  return 0;
}

/**
  * @brief  Receive a file using the ymodem protocol.
  * @param  buf: Address of the first byte.
  * @retval The size of the file.
  */
int32_t Ymodem_Receive (uint8_t *buf)
{
  uint8_t packet_data[PACKET_1K_SIZE + PACKET_OVERHEAD], file_size[FILE_SIZE_LENGTH], *file_ptr, *buf_ptr;
  int32_t i, packet_length, session_done, file_done, packets_received, errors, session_begin, size = 0;
  uint32_t flashdestination, ramsource;
	int ret;

  /* Initialize flashdestination variable */
  flashdestination = APPLICATION_ADDRESS;

  for (session_done = 0, errors = 0, session_begin = 0; ;)
  {
    for (packets_received = 0, file_done = 0, buf_ptr = buf; ;)
    {
      switch (Receive_Packet(packet_data, &packet_length, NAK_TIMEOUT))
      {
        case 0:
          errors = 0;
          switch (packet_length)
          {
            /* Abort by sender */
            case -1:
              Send_Byte(YMODEM_ACK);
						  tcp_valid = 0;
              return 0;
            /* End of transmission */
            case 0:
              Send_Byte(YMODEM_ACK);
              file_done = 1;
              break;
            /* Normal packet */
            default:
              if ((packet_data[PACKET_SEQNO_INDEX] & 0xff) != (packets_received & 0xff))
              {
                Send_Byte(YMODEM_NAK);
              }
              else
              {
                if (packets_received == 0)
                {
                  /* Filename packet */
                  if (packet_data[PACKET_HEADER] != 0)
                  {
                    /* Filename packet has valid data */
                    for (i = 0, file_ptr = packet_data + PACKET_HEADER; (*file_ptr != 0) && (i < FILE_NAME_LENGTH);)
                    {
                      FileName[i++] = *file_ptr++;
                    }
                    FileName[i++] = '\0';
                    for (i = 0, file_ptr ++; (*file_ptr != ' ') && (i < FILE_SIZE_LENGTH);)
                    {
                      file_size[i++] = *file_ptr++;
                    }
                    file_size[i++] = '\0';
//                    Str2Int(file_size, &size);
										size = stringtoul((const char*)file_size,&ret);

                    /* Test the size of the image to be sent */
                    /* Image size is greater than Flash size */
                    if (size > (USER_FLASH_SIZE + 1))
                    {
                      /* End session */
                      Send_Byte(YMODEM_CAN);
                      Send_Byte(YMODEM_CAN);
											tcp_valid = 0;
                      return -1;
                    }
//                  /* erase user application area */
										/* Erase the needed pages where the user application will be loaded */
                    /* Define the number of page to be erased */
										{
											size = stringtoul((const char*)file_size,&ret);
											uint32_t startsec = FLASH_IF_GetSector(APPLICATION_ADDRESS);
											uint32_t stopsec = FLASH_IF_GetSector(APPLICATION_ADDRESS+size);
											/* Erase the FLASH pages */
											FLASH_If_Erase(startsec,stopsec);
										}
                    Send_Byte(YMODEM_ACK);
                    Send_Byte(YMODEM_CRC);
                  }
                  /* Filename packet is empty, end session */
                  else
                  {
                    Send_Byte(YMODEM_ACK);
                    file_done = 1;
                    session_done = 1;
                    break;
                  }
                }
                /* Data packet */
                else
                {
									for(unsigned i=0;i<packet_length;i++){
										*(buf_ptr+i)=*(packet_data+PACKET_HEADER+i);
									}
//                  memcpy(buf_ptr, packet_data + PACKET_HEADER, packet_length);
                  ramsource = (uint32_t)buf;
									{
										uint32_t j;
										size = stringtoul((const char*)file_size,&ret);
										for (j = 0;(j < packet_length) && (flashdestination <  APPLICATION_ADDRESS + size);j += 4)
										{
											/* Program the data received into STM32F10x Flash */
											FLASH_ProgramWord(flashdestination, *(uint32_t*)ramsource);
											if (*(uint32_t*)flashdestination != *(uint32_t*)ramsource)
											{
												/* End session */
												Send_Byte(YMODEM_CAN);
												Send_Byte(YMODEM_CAN);
												tcp_valid = 0;
												return -2;
											}
											flashdestination += 4;
											ramsource += 4;
										}
										Send_Byte(YMODEM_ACK);
									}
                }
                packets_received ++;
                session_begin = 1;
              }
          }
          break;
        case 1:
          Send_Byte(YMODEM_CAN);
          Send_Byte(YMODEM_CAN);
					tcp_valid = 0;
          return -3;
        default:
          if (session_begin > 0)
          {
            errors ++;
          }
          if (errors > MAX_ERRORS)
          {
            Send_Byte(YMODEM_CAN);
            Send_Byte(YMODEM_CAN);
						tcp_valid = 0;
            return 0;
          }
          Send_Byte(YMODEM_CRC);
					Use_CRC=1;
          break;
      }
      if (file_done != 0)
      {
        break;
      }
    }
    if (session_done != 0)
    {
      break;
    }
  }
	tcp_valid = 0;
	printk("\nFile %s (%s bytes) ",FileName,file_size);
	return (int32_t)(size);
}

/**
  * @brief  check response using the ymodem protocol
  * @param  buf: Address of the first byte
  * @retval The size of the file
  */
int32_t Ymodem_CheckResponse(uint8_t c)
{
  return 0;
}

/**
  * @brief  Prepare the first block
  * @param  timeout
  *     0: end of transmission
  * @retval None
  */
void Ymodem_PrepareIntialPacket(uint8_t *data, const uint8_t* fileName, uint32_t *length)
{
  uint16_t i, j;
  uint8_t file_ptr[10];
  
  /* Make first three packet */
  data[0] = YMODEM_SOH;
  data[1] = 0x00;
  data[2] = 0xff;
  
  /* Filename packet has valid data */
  for (i = 0; (fileName[i] != '\0') && (i < FILE_NAME_LENGTH);i++)
  {
     data[i + PACKET_HEADER] = fileName[i];
  }

  data[i + PACKET_HEADER] = 0x00;
  
  Int2Str (file_ptr, *length);
  for (j =0, i = i + PACKET_HEADER + 1; file_ptr[j] != '\0' ; )
  {
     data[i++] = file_ptr[j++];
  }
  
  for (j = i; j < PACKET_SIZE + PACKET_HEADER; j++)
  {
    data[j] = 0;
  }
}

/**
  * @brief  Prepare the data packet
  * @param  timeout
  *     0: end of transmission
  * @retval None
  */
void Ymodem_PreparePacket(uint8_t *SourceBuf, uint8_t *data, uint8_t pktNo, uint32_t sizeBlk)
{
  uint16_t i, size, packetSize;
  uint8_t* file_ptr;
  
  /* Make first three packet */
  packetSize = sizeBlk >= PACKET_1K_SIZE ? PACKET_1K_SIZE : PACKET_SIZE;
  size = sizeBlk < packetSize ? sizeBlk :packetSize;
  if (packetSize == PACKET_1K_SIZE)
  {
     data[0] = YMODEM_STX;
  }
  else
  {
     data[0] = YMODEM_SOH;
  }
  data[1] = pktNo;
  data[2] = (~pktNo);
  file_ptr = SourceBuf;
  
  /* Filename packet has valid data */
  for (i = PACKET_HEADER; i < size + PACKET_HEADER;i++)
  {
     data[i] = *file_ptr++;
  }
  if ( size  <= packetSize)
  {
    for (i = size + PACKET_HEADER; i < packetSize + PACKET_HEADER; i++)
    {
      data[i] = 0x1A; /* EOF (0x1A) or 0x00 */
    }
  }
}

/**
  * @brief  Update YMODEM_CRC for input byte
  * @param  CRC input value 
  * @param  input byte
  * @retval None
  */
uint16_t UpdateCRC16(uint16_t crcIn, uint8_t byte)
{
  uint32_t crc = crcIn;
  uint32_t in = byte | 0x100;

  do
  {
    crc <<= 1;
    in <<= 1;
    if(in & 0x100)
      ++crc;
    if(crc & 0x10000)
      crc ^= 0x1021;
  }
  
  while(!(in & 0x10000));

  return crc & 0xffffu;
}


/**
  * @brief  Cal YMODEM_CRC for YModem Packet
  * @param  data
  * @param  length
  * @retval None
  */
uint16_t Cal_CRC16(const uint8_t* data, uint32_t size)
{
  uint32_t crc = 0;
  const uint8_t* dataEnd = data+size;

  while(data < dataEnd)
    crc = UpdateCRC16(crc, *data++);
 
  crc = UpdateCRC16(crc, 0);
  crc = UpdateCRC16(crc, 0);

